verification/runs/F5_runs/re3900/case/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-07;

boundaryField
{
    farfield
    {
        type            freestream;
        freestreamValue uniform 3.75e-07;
        value           uniform 3.75e-07;
    }
    cylinder
    {
        type            kLowReWallFunction;
        value           uniform 1e-12;
    }
    frontAndBack
    {
        type            empty;
    }
}
