verification/runs/F5_runs/re3900/case/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 2.3076923e-06;

boundaryField
{
    farfield
    {
        type            freestream;
        freestreamValue uniform 2.3076923e-06;
        value           uniform 2.3076923e-06;
    }
    cylinder
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}
