verification/runs/F5_runs/re3900/case/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.1625;

boundaryField
{
    farfield
    {
        type            freestream;
        freestreamValue uniform 0.1625;
        value           uniform 0.1625;
    }
    cylinder
    {
        type            omegaWallFunction;
        blended         true;
        value           uniform 0.1625;
    }
    frontAndBack
    {
        type            empty;
    }
}
