verification/runs/F5_runs/re3900/case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0.35355339 -0.35355339 0)
    (0.35355339 0.35355339 0)
    (-0.35355339 0.35355339 0)
    (-0.35355339 -0.35355339 0)
    (14.142136 -14.142136 0)
    (14.142136 14.142136 0)
    (-14.142136 14.142136 0)
    (-14.142136 -14.142136 0)
    (0.35355339 -0.35355339 0.1)
    (0.35355339 0.35355339 0.1)
    (-0.35355339 0.35355339 0.1)
    (-0.35355339 -0.35355339 0.1)
    (14.142136 -14.142136 0.1)
    (14.142136 14.142136 0.1)
    (-14.142136 14.142136 0.1)
    (-14.142136 -14.142136 0.1)
);

blocks
(
    hex (0 4 5 1 8 12 13 9) (110 100 1) simpleGrading (280.383 1 1)
    hex (1 5 6 2 9 13 14 10) (110 100 1) simpleGrading (280.383 1 1)
    hex (2 6 7 3 10 14 15 11) (110 100 1) simpleGrading (280.383 1 1)
    hex (3 7 4 0 11 15 12 8) (110 100 1) simpleGrading (280.383 1 1)
);

edges
(
    arc 0 1 (0.5 0 0)
    arc 8 9 (0.5 0 0.1)
    arc 4 5 (20 0 0)
    arc 12 13 (20 0 0.1)
    arc 1 2 (3.061617e-17 0.5 0)
    arc 9 10 (3.061617e-17 0.5 0.1)
    arc 5 6 (1.2246468e-15 20 0)
    arc 13 14 (1.2246468e-15 20 0.1)
    arc 2 3 (-0.5 6.123234e-17 0)
    arc 10 11 (-0.5 6.123234e-17 0.1)
    arc 6 7 (-20 2.4492936e-15 0)
    arc 14 15 (-20 2.4492936e-15 0.1)
    arc 3 0 (-9.184851e-17 -0.5 0)
    arc 11 8 (-9.184851e-17 -0.5 0.1)
    arc 7 4 (-3.6739404e-15 -20 0)
    arc 15 12 (-3.6739404e-15 -20 0.1)
);

boundary
(
    cylinder
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (3 0 8 11)
        );
    }
    farfield
    {
        type patch;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 4 12 15)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (8 12 13 9)
            (1 5 6 2)
            (9 13 14 10)
            (2 6 7 3)
            (10 14 15 11)
            (3 7 4 0)
            (11 15 12 8)
        );
    }
);

mergePatchPairs
(
);
